#+TITLE: Structured Query Language - HW day 2
#+AUTHOR: M. Surmashev @muradbei
#+PROPERTY: header-args:sql :engine postgresql :dbport 5400 :dbhost localhost :dbuser postgres :dbpassword postgres :database postgres

* Task 1 - Largest Organization

  В таблице со списком огранизаций, найти головную организацию с наибольшим числом отделений (с учетом головной огранизации).

** Входные данные

   #+BEGIN_SRC sql
     create table organization (
       id int,
       parent int,
       name text
     );
   #+END_SRC

   #+BEGIN_SRC sql
     insert into organization (id, parent, name)
     values (1, null, 'ГКБ 1')
	    ,(2, null, 'ГКБ 2')
	    ,(3, 1, 'Детское отделение')
	    ,(4, 3, 'Правое крыло')
	    ,(5, 4, 'Кабинет педиатра')
	    ,(6, 2, 'Хирургия')
	    ,(7, 6, 'Кабинет 1')
	    ,(8, 6, 'Кабинет 2')
	    ,(9, 6, 'Кабинет 3')
   #+END_SRC

** Ожидаемый результат

   | name  | cnt |
   |-------+-----|
   | ГКБ 2 |   5 |


* Task 2 - Materialized path

  Для таблицы ~organization~ добавть колонку ~pth~ с типом ~int[]~

  Заполнить колонку ~path~ массивом ~id~ всех родительских отделений

** Входные данные

   Таблица огранизаций

   #+BEGIN_SRC sql
     select * from organization;
   #+END_SRC

   #+RESULTS:
   | id | parent | name              |
   |----+--------+-------------------|
   |  1 |        | ГКБ 1             |
   |  2 |        | ГКБ 2             |
   |  3 |      1 | Детское отделение |
   |  4 |      3 | Правое крыло      |
   |  5 |      4 | Кабинет педиатра  |
   |  6 |      2 | Хирургия          |
   |  7 |      6 | Кабинет 1         |
   |  8 |      6 | Кабинет 2         |
   |  9 |      6 | Кабинет 3         |


** Ожидаемый результат

   #+BEGIN_SRC sql
     select * from organization;
   #+END_SRC

   #+RESULTS:
   | id | parent | name              | pth     |
   |----+--------+-------------------+---------|
   |  1 |        | ГКБ 1             | {}      |
   |  2 |        | ГКБ 2             | {}      |
   |  3 |      1 | Детское отделение | {1}     |
   |  4 |      3 | Правое крыло      | {1,3}   |
   |  5 |      4 | Кабинет педиатра  | {1,3,4} |
   |  6 |      2 | Хирургия          | {2}     |
   |  7 |      6 | Кабинет 1         | {2,6}   |
   |  8 |      6 | Кабинет 2         | {2,6}   |
   |  9 |      6 | Кабинет 3         | {2,6}   |


* Task 3 - Use materialized path

  Используя материализованный путь, найти все отделения принадлежащие =ГКБ 2=

** Ожидаемый результат

   #+RESULTS:
   | id | parent | name      | pth   |
   |----+--------+-----------+-------|
   |  6 |      2 | Хирургия  | {2}   |
   |  7 |      6 | Кабинет 1 | {2,6} |
   |  8 |      6 | Кабинет 2 | {2,6} |
   |  9 |      6 | Кабинет 3 | {2,6} |
